Revit 2027 API
Tile.TileBrickType Property
 The property labeled "Type" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TileBrickType { get; }
Public Shared ReadOnly Property TileBrickType As String
	Get
public:
static property String^ TileBrickType {
	String^ get ();
}
static member TileBrickType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "TileBrickType".
See Also
Reference
Tile Class
Autodesk.Revit.DB.Visual Namespace